app/views/welcome/index.html.erb

    <ul class="home_category_list">
      <% @current_region.subregions.each do |subregion| %>
---
SELECT "subregions".* FROM "subregions" WHERE "subregions"."region_id" = $1  [["region_id", 3]]