app/views/posts/_form.html.erb

  <select name="post[category_id]">
    <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"