app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."category" = $1 LIMIT $2  [["category", "w4m"], ["LIMIT", 1]]
---
  def show
    @category = Category.find_by_category(params[:id]) ##sloppy - need to fix properly, works for now