app/controllers/posts_controller.rb

  def index
    @posts = Post.search(params[:search])
---
SELECT "posts".* FROM "posts" WHERE (lower(title) LIKE '%love%')

  def create
    @post = current_user.posts.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "category_id", "user_id", "latitude", "longitude", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"